Revit 2027 API
SATExportOptions(SATExportOptions) Constructor
 Constructs a new instance of SATImportOptions as a copy of the export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SATExportOptions(
	SATExportOptions option
)
Public Sub New (
	option As SATExportOptions
)
public:
SATExportOptions(
	SATExportOptions^ option
)
new :
        option : SATExportOptions -> SATExportOptions
Parameters
option SATExportOptions
 The options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SATExportOptions Class
SATExportOptions Overload
Autodesk.Revit.DB Namespace